# Pandas Commands
> A list of Pandas Commands

- toc: true
- branch: master
- badges: true
- comments: true
- categories: [fastpages, jupyter]
- image: images/pandas.png

In [ ]:
import pandas
import pandas as pd
import altair as alt

#About

This blog post displays several Pandas commands that have helped me throughout this internship.
I have seperated the commands into four categories: general dataframes commands, column commands, row commands, and CPTAC commands.
I hope this post will be helpful to those who are new to Pandas or just need a reminder of the commands.

#General Dataframe Commands

In [ ]:
#Creating Dataframe from TSV/CSV File
df = pandas.read_csv('name of file.tsv', sep = '\t')

In [ ]:
#Creating Dataframe from TSV/CSV File
df = pandas.read_excel('name of file.xlsx')

In [ ]:
#Create your own Dataframe
df = ({'Cost':[1, 2, 3],
        'Revenue': [4, 5, 6]})
df = pd.DataFrame(df)

In [ ]:
#collapse-output
#Display Dataframe
df

   Cost  Revenue
0     1        4
1     2        5
2     3        6

In [ ]:
#collapse-output
#Transpose Dataframe
df.transpose()

         0  1  2
Cost     1  2  3
Revenue  4  5  6

In [ ]:
#collapse-output
#View datatypes, columns, index, and memory usage
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Cost    3 non-null      int64
 1   Profit  3 non-null      int64
dtypes: int64(2)
memory usage: 176.0 bytes

#Column Commands

In [ ]:
#collapse-output
#Edit Title of a column
df.rename(columns = {'Revenue' : 'Profit'}, inplace=True)
df

   Cost  Profit
0     1       4
1     2       5
2     3       6

In [ ]:
#collapse-output
#Add a new column
Price = [7, 8, 9]
df['Price'] = Price
df

   Cost  Profit  Price
0     1       4      7
1     2       5      8
2     3       6      9

In [ ]:
#collapse-output
#Remove a column
df.drop(columns=['Price'], inplace=True)
df

   Cost  Profit
0     1       4
1     2       5
2     3       6

In [ ]:
#collapse-output
#Add a value to dataframe
df += 1
df

   Cost  Profit
0     3       6
1     4       7
2     5       8

In [ ]:
#collapse-output
#Subtract a value to dataframe
df -= 1
df

   Cost  Profit
0     1       4
1     2       5
2     3       6

#Rows

In [ ]:
#collapse-output
#Find a row based off its index
df.loc[0]

Cost      1
Profit    4
Name: 0, dtype: int64

In [ ]:
#collapse-output
#Find a row based off value
filt = (df['Cost'] == 2)
df[filt]

   Cost  Profit
1     2       5

In [ ]:
#collapse-output
#Find rows without missing values
df.Cost.notnull()

0    True
1    True
2    True
Name: Cost, dtype: bool

#CPTAC Commands

In [ ]:
import cptac

In [ ]:
#collapse-output
#View all datasets
cptac.list_datasets()

,Description,Data reuse status,Publication link
Dataset name,,,
Brca,breast cancer,no restrictions,https://pubmed.ncbi.nlm.nih.gov/33212010/
Ccrcc,clear cell renal cell carcinoma (kidney),no restrictions,https://pubmed.ncbi.nlm.nih.gov/31675502/
Colon,colorectal cancer,no restrictions,https://pubmed.ncbi.nlm.nih.gov/31031003/
Endometrial,endometrial carcinoma (uterine),no restrictions,https://pubmed.ncbi.nlm.nih.gov/32059776/
Gbm,glioblastoma,no restrictions,https://pubmed.ncbi.nlm.nih.gov/33577785/
Hnscc,head and neck squamous cell carcinoma,no restrictions,https://pubmed.ncbi.nlm.nih.gov/33417831/
Lscc,lung squamous cell carcinoma,no restrictions,https://pubmed.ncbi.nlm.nih.gov/34358469/
Luad,lung adenocarcinoma,no restrictions,https://pubmed.ncbi.nlm.nih.gov/32649874/
Ovarian,high grade serous ovarian cancer,no restrictions,https://pubmed.ncbi.nlm.nih.gov/27372738/
Pdac,pancreatic ductal adenocarcinoma,no restrictions,https://pubmed.ncbi.nlm.nih.gov/34534465/
UcecConf,endometrial confirmatory carcinoma,password access only,unpublished
GbmConf,glioblastoma confirmatory,password access only,unpublished

In [ ]:
#collapse-output
#Download a dataset
cptac.download(dataset = "name of dataset")